Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetStringUserProperties Method (Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetStringUserProperties(
	out Dictionary<string, string> values
)
Public Function GetStringUserProperties (
	<OutAttribute> ByRef values As Dictionary(Of String, String)
) As Boolean
Parameters
values
Type: System.Collections.Generic.Dictionary<String, String>
Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Return Value
Type: Boolean
True if the request succeeded (the returned values can still be empty if no UserProperties were found).
See Also
Reference
DatabaseObject Class
GetStringUserProperties Overload
Tekla.Structures.Drawing Namespace